In [1]:
import numpy as np
import pandas as pd

In [3]:
import seaborn as sns

In [4]:
titanic = sns.load_dataset("titanic")

In [25]:
titanic.head()[["survived", "sex", "class", "age"]]

   survived     sex  class   age
0         0    male  Third  22.0
1         1  female  First  38.0
2         1  female  Third  26.0
3         1  female  First  35.0
4         0    male  Third  35.0

In [26]:
titanic.describe()[["survived", "pclass", "age"]]

         survived      pclass         age
count  891.000000  891.000000  714.000000
mean     0.383838    2.308642   29.699118
std      0.486592    0.836071   14.526497
min      0.000000    1.000000    0.420000
25%      0.000000    2.000000   20.125000
50%      0.000000    3.000000   28.000000
75%      1.000000    3.000000   38.000000
max      1.000000    3.000000   80.000000

### Pivot Tables by Hand: grouping in 2 dimensions

In [11]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [8]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

### Returning either a series or a pandas object

In [9]:
type(titanic.groupby("sex")[["survived"]].mean())

pandas.core.frame.DataFrame

In [10]:
type(titanic.groupby("sex")["survived"].mean())

pandas.core.series.Series

### The impact of unstack

In [12]:
titanic.groupby(["sex", "class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

### The (lack of) impact of aggregate

In [14]:
titanic.groupby(["sex", "class"])[["survived"]].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [16]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447